Revit 2026 API

# DuctFittingAndAccessoryConnectorData Methods

---

The DuctFittingAndAccessoryConnectorData type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetCoordination | Gets the coordination of the connector |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

DuctFittingAndAccessoryConnectorData Class

Autodesk.Revit.DB.Mechanical Namespace